
var provice_set = {
    'จ.ขอนแก่น': [16.4419355,102.8359921],
    'จ.นครนายก': [14.2069466,101.21305110000003],
    'จ.นครราชสีมา': [14.9798997,102.09776929999998],
    'จ.บุรีรัมย์': [14.9930017,103.10291910000001],
    'จ.มหาสารคาม': [16.1850896,103.30264609999995],
    'จ.มุกดาหาร': [16.542443,104.72091509999996],
    'จ.ยโสธร': [15.792641,104.14528270000005],
    'จ.ร้อยเอ็ด': [16.0538196,103.65200359999994],
    'จ.ศรีสะเกษ': [15.1186009,104.32200949999992],
    'จ.สุรินทร์': [14.882905,103.49371070000007],
    'จ.อำนาจเจริญ': [15.8656783,104.62577740000006],
    'จ.อุบลราชธานี': [15.2286861,104.85642170000006],
}

var Basin22_name = {
	'มูล' : [15.13, 103.36],
	'ชี' : [16.82, 102.85],
	'โขงตะวันออกเฉียงเหนือ' : [17.77,103.74],
	'โตนเลสาบ' : [14.00,102.54],
	'บางปะกง' : [13.96,101.51],
	'เจ้าพระยา' : [15.24,100.47],
	'ท่าจีน' : [14.62,99.86],
	'แม่กลอง' : [14.68,99.04],
	'เพชรบุรี-ประจวบคีรีขันธ์' : [12.67,99.64],
	'ภาคใต้ฝั่งตะวันออกตอนบน' : [8.76,99.45],
	'ภาคใต้ฝั่งตะวันตก' : [7.71,99.49],
	'ทะเลสาบสงขลา' : [7.23,100.31],
	'ภาคใต้ฝั่งตะวันออกตอนล่าง' : [6.36,101.43],
	'ชายฝั่งทะเลตะวันออก' : [12.99,101.78],
	'ภาคใต้ฝั่งตะวันตก' : [8.53,98.39],
	'น่าน' : [17.85,100.58],
	'โขงเหนือ' : [19.80,99.77],
	'ยม' : [17.09,99.74],
	'วัง' : [18.28,99.47],
	'ปิง' : [18.51,98.65],
	'สาละวิน' : [18.19, 97.89],
	'สะแกกรัง' : [15.70,99.48],
	'ป่าสัก' : [15.39,101.21],
}

var val = {}
var layout = {}
var marker = {}
var data_fetch = {}
var limit_page = {}

var group_tooltip = L.layerGroup().addTo(map)